class BotMessages:
    # register messages
    welcome = "✨ خوش آمدید به Gamify360! 🎮\n\nاین ربات جدید برای کلاس بازاریابی گیمیفیکیشن طراحی شده است.\n\nآیا می‌خواهید:\n1. بازی سرگرم‌کننده‌ای را تجربه کنید؟\n2. یاد بگیرید چگونه بازاریابی را با گیمیفیکیشن جذاب کنید؟\n3. در رقابت با دوستان خود شرکت کنید؟\n\nبرای شروع، روی دکمه منو اصلی کلیک کنید!"
    
    help = "🎮 راهنمای Gamify360:\n\n1. 🎮 بازی‌های سرگرم‌کننده\n2. 🏆 رتبه‌بندی\n3. 🎁 جوایز ویژه\n4. 🎯 چالش‌های روزانه\n\nبرای شروع، روی دکمه منو کلیک کنید!"

    
    menu = "🎮 منوی اصلی:\n\n1. 🎮 بازی‌های سرگرم‌کننده\n2. 🏆 رتبه‌بندی\n3. 🎁 جوایز\n4. 🎯 چالش‌ها\n5. 📚 راهنمای بازاریابی گیمیفیکیشن"
    
    game_menu = "🎮 بازی‌های موجود:\n\n1. 🎮 سلوت ماشین 3D\n2. 🎲 بازی‌های تصادفی\n3. 🎯 چالش‌های روزانه\n\nبرای شروع بازی، روی یکی از گزینه‌ها کلیک کنید!"
    
    leaderboard = "🏆 رتبه‌بندی:\n\n1. 🏆 رتبه‌بندی کلی\n2. 🏆 رتبه‌بندی هفته‌ای\n3. 🏆 رتبه‌بندی ماهانه\n\nبرای مشاهده رتبه‌بندی، روی یکی از گزینه‌ها کلیک کنید!"
    
    rewards = "🎁 جوایز:\n\n1. 🏆 رتبه‌بندی کلی\n2. 🏆 رتبه‌بندی هفته‌ای\n3. 🏆 رتبه‌بندی ماهانه\n\nبرای مشاهده رتبه‌بندی، روی یکی از گزینه‌ها کلیک کنید!"
    
    challenges = "🎯 چالش‌های روزانه:\n\n1. 🎮 بازی سلوت ماشین\n2. 🎲 بازی‌های تصادفی\n3. 🎯 چالش‌های روزانه\n\nبرای شروع چالش، روی یکی از گزینه‌ها کلیک کنید!"
    
    gamification_guide = "📚 راهنمای بازاریابی گیمیفیکیشن:\n\n1. 🎮 مفهوم گیمیفیکیشن\n2. 🏆 استراتژی‌های رتبه‌بندی\n3. 🎁 طراحی جوایز\n4. 🎯 ایجاد چالش‌ها\n\nبرای یادگیری بیشتر، روی یکی از گزینه‌ها کلیک کنید!"
    
    error = "⚠️ خطایی رخ داده است. لطفاً دوباره سعی کنید."




# class ConversationStates:
#     CATEGORY, LOCATION, PRODUCT_INFO, PRODUCT, CONFIRM_ORDER, PRODUCT_ADDED_TO_ORDER, PAYMENT, PRODUCT_COUNT = range(8)
