class QuizConstants:
    questions = [
        {
            "question": "هدف اصلی گیمیفیکیشن چیست؟",
            "options": [
                "A) فروش بیشتر",
                "B) تفریح و لذت",
                "C) افزایش مشارکت و انگیزه",
            ],
            "correct":  "C) افزایش مشارکت و انگیزه",
            "explanation": "" },
        {
            "question": "با توجه به مطالب ارائه شده گیمیفیکیشن چطور ممکنه باعث آسیب به کاربران بشه؟",
            "options": [
                "A) باعث شود کاربران به راحت طلبی عادت کنند.",
                "B) زمان و انرژی آنها را هدر دهد.",
                "C) رویداد ها را جذاب تر از آنچه که هستند نشان دهد.",
            ],
            "correct": "C) رویداد ها را جذاب تر از آنچه که هستند نشان دهد.",
            "explanation": ""
        },
        {
            "question": "چه چیزی در بازاریابی گیمیفیکیشن مهم‌ترین فاکتور است؟",
            "options": [
                "A) جوایز مادی",
                "B) سیستم رتبه‌بندی",
                "C) انگیزه‌های داخلی",
                "D) تبلیغات"
            ],
            "correct": "C) انگیزه‌های داخلی",
            "explanation": "انگیزه‌های داخلی که از طریق گیمیفیکیشن ایجاد می‌شود، مهم‌ترین فاکتور در موفقیت بازاریابی است."
        }
    ]

    states = {
        'QUIZ_QUESTION_1': 1,
        'QUIZ_QUESTION_2': 2,
        'QUIZ_QUESTION_3': 3
    }

    messages = {
        'start': "آماده شوید برای شرکت در آزمون بازاریابی گیمیفیکیشن",
        'completed': "آزمون شما به پایان رسید!\n\nنتایج شما:\n✅ پاسخ‌های درست: {correct}\n❌ پاسخ‌های نادرست: {incorrect}"
    }
